doc/touch-actions.org
* hello, motivation for this document
This document talks about what I've been thinking about re: input handling 
in hubs. Several points were made a couple weeks ago that I want to recall.
See https://github.com/johnshaughnessy/ux_design_mtg/blob/master/design_notes.org
for more details.
We talked about:
- closing the existing gaps in 3D manipulation for each input device,
- wanting to offer additional degrees of freedom to the user when 
  altering the the "brush characteristics" of the pen
- how we are very limited on input on certain devices. it sometimes feels 
  "impossible to get what you want". 
- wanting something you can do (menus, buttons, something to press) 
  to unlock richness of the interaction space 
  available to you if only we can use the buttons and axes at your disposal 
  strategically, especially a device with limited inputs like a daydream 
  or go controller.
- wanting to experiment with navigating a menu or 
  muting-without-pointing-at-floating-button,
- concern that although our interactions "work", they do so in an undesirably
  ad-hoc fashion. each one is a new modality to learn. they are "serviceable" 
  but not "delightful" to interact with, and we would like it to be more 
  "delightful" moving forward.
- concern about spending too much time and effort trying to change the 
  input code. Spending time on it may not be a good strategy if we are close to 
  having everything we need to validate that certain types of interaction 
  are worth doing, and that if users like doing them, we can feel confident 
  recommending that more people use our product for those kinds of interactions,
  and maybe we can decide to support those interactions even better.  

Kudos to Kevin, who added the ability to draw with a customizable color and 
brush size last week. Along with these changes he also wrote in the ability
to scale objects with the mouse, filling another of the gaps.

Dom added support to play and pause videos, which at the moment 
this happens a little more often than we mean for it to, because grabbing 
a video to move it also counts as a play or a pause. Still, this is way 
better than not being able to pause videos at all.

Rotating objects with the touchscreens is limited to the y axis. 
Scaling is not yet supported. I spend some time thinking through using 
pinch to scale ducks. I don't quite know the best way to implement it, 
but it's likely reserving fingers for a pinch differently depending on 
the results of a raycast on that touch, to know whether we're scaling a 
duck or just pinching-to-move. It also doesn't account for the possibility 
of being too close to a duck and then wanting to move backwards but 
instead scaling the duck you're too clode to. Drawing on mobile is not 
yet supported but could be. Pinching to move will interact with having a 
sticky object in your hand, but as long as we order things correctly it 
should still work. I think our sentement was that we felt ok about drawing 
not working on mobile, because maybe it's not so important for people to 
draw with fingers or a stylus and it's worth getting into peoples' 
6DOF-driven-hands now that we can.

I think our collaboration in that meeting was somewhat limited 
by the scope of our intended discussion and the capabilities of the meeting 
place we chose. We didn't discuss code examples and we didn't type. This is 
a kind of (late to the game, but hopefully still relevant) contribution to 
that same discussion, or thread of discussion, or ongoing conversation 
we're having about what to do next as we do the stuff we want to do right now.

One sentiment expressed was that there may no be "any new 
universal design language that we can both solve some of these issues 
and solve the issues we’re also talking about, namely 3D object interaction 
AND also the tool controls."

And I agree insofar as I don't know what a universal design language would 
be that solved everything. In lieu of a universal one, I think there are some 
design language or patterns for which there is prior art we can mimic to make it 
easier for us to solve some of the problems we face when trying to change, 
or add interaction mechanics to the client.
