src/touch-actions.html
<div id="outline-container-org800d34c" class="outline-2">
<h2 id="org800d34c"><span class="section-number-2">2</span> about this branch (actions)</h2>
<div class="outline-text-2" id="text-2">
<p>
This document describes an aframe system called actions whose main loop 
runs alongside all the other aframe system ticks, in some order. 
</p>

<p>
We considered writing something like this actions system as a standalone 
library so authors of other web applications with similar interaction needs
could benefit and contribute, and so we would have a "web-based" input handling
system similar enough to OpenXR to better understand application patterns that
might emerge as it approaches ratification, implementation, adoption.
</p>

<p>
We care most that js apps like ours can access this system's capabilities, 
so we say "web-based" instead of saying "js library"  because for all I care 
this code could be written in (for example) rust and compiled to webassembly.
</p>

<p>
Given that FxR may want to write itself (as an application) against 
many types of input devices, perhaps a rust library may allow more people to 
be involved, as it may serve more peoples' needs or at least be a point of 
comparison with more in common to those FxR developers codebase. Prior art
is mentioned below, but I have not seen anything like this written in rust
(but I haven't looked so don't take that as evidence that no such library 
exists).
</p>

<p>
The code is nascent at the time of this writing and will change a lot unless
everyone says I should stop working on this and work on something more useful.
I don't know where to draw the line between the "library" and "app code". 
Still, I sometimes refer to the actions system as "library code", 
and anything using it (i.e. the rest of our aframe application) as "app code". 
</p>

<p>
Given the the unproven state of this code and the ideas it tries to express, 
I'm not concerned with making this grow to other teams or projects at this 
time. That could change if it turns out that this attempted fix of problems 
outlined below is effective, which I don't know until it is further along 
and "put to the test".
</p>

<p>
I'm writing it in js on a branch of hubs, because that is how locally 
I care to satisfy these input needs, and hope to employ some strategy 
for thinking about and describing user interaction so as to make 
application code easier to write simply. 
That is, I want it to be easier to write simple application code, 
and I think this model is a way of doing that, and it comes at the 
cost of adding complexity between the user's input devices and the 
application code that queries the "action frame". 
I argue that this is essential complexity, and it is 
better handled "earlier" in the model than where it is handled now, 
which I call "app code".
</p>

<p>
The system was written into the hubs client because I don't know where the 
app should start and the library should end, and I wanted to make sure the 
ideas stood up to our existing application's already substantial set of 
interaction needs.
</p>
</div>

<div id="outline-container-orgddfd250" class="outline-4">
<h4 id="orgddfd250"><span class="section-number-4">2.0.1</span> Feedback welcome</h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
The motivation for writing this document is in part to solicit criticism
and feedback about whether this code actually meets its aims, which are to  
</p>

<ul class="org-ul">
<li>minimize the amount of "input-based branching" required of app code,</li>
<li>support a wide variety of input devices,</li>
<li>allow people to customize the way they "drive" the application by 
"binding" an application's "actions" to their input device's capabilities
(buttons, joysticks, axes) via "filters" (name subject to change), and</li>
<li>reduce the complexity of cursor-controller, drawing-manager, 
character-controller, interactables, and anything else that touches 
input, allowing us to write new interactions (e.g. change the volume 
of a video, select pen color from a color picker) into our app
faster and with fewer bugs.</li>
</ul>

<p>
If these aims are not met, are there changes that would allow them to be,
or are there critical errors that cannot be fixed without changing the 
mental model for handling input? (In case it's not clear, this is not a
rhetorical question. Please give feedback if you can.)
</p>
</div>
</div>

<div id="outline-container-orgd972d24" class="outline-4">
<h4 id="orgd972d24"><span class="section-number-4">2.0.2</span> Prior art</h4>
<div class="outline-text-4" id="text-2-0-2">
<p>
There is some prior art this code is based on. I can provide more information
about each, but for now I will summarize as follows: 
</p>
<ul class="org-ul">
<li>The steam controller API influenced my thinking on this problem.</li>
<li>OpenXR's proposal for handling input is similar in many ways to what is 
written here (probably because it is written by the same people who 
wrote the steam controller API).</li>
<li>Trevor wrote some code in a shared repo that captured some of these ideas.
There were enough minor things I wanted to try to do differently that it 
that it made more sense to me to start from scratch than start from what he'd
written. I want to compare his approach to what's implemented here and 
hopefully learn something from the differences.</li>
<li>Fernando (and co)'s `aframe-input-mappings` captures some of these ideas 
as well, and we make use of them in our application.
As a minimal experiment, I replaced the keyboard bindings 
in hubs' "input-mappings.js" which bound the keyboard to named events via 
`aframe-input-mappings` with code that exposes the current state of the keyboard
through an api that took an "action name" and responded with a boolean value.</li>
<li>The addition of "behaviors" to `input-mappings` satisfied some of our input 
needs when it came to transforming the input from a device to ready it for 
use in the application (see scrolling, or dpad implementations.)</li>
<li>I wrote branch of three.js a few weeks ago that had a kind of primitive cursor
that was driven by oculus touch through an actions system like frame + binding 
definition + mapping process.</li>
</ul>
</div>
</div>
