doc/touch-actions.org
*** Progress report
I have so far supported the mouse, keyboard, and am working adding touchscreen 
support. Supporting touchscreens in our application has been challenging so far.
Below I will talk through what some of the challenges have been, and how I 
want to handle them or did handle them (if I do).

I hope that by driving the application with the touchscreen and this actions 
system, where to draw a line between "library" code and "app code" will 
be made clearer.

After touchscreen, I suspect that support for 3DOF, 6DOF, and gamepads will 
follow rapidly. The biggest differences I anticipate when adding support for 
those are:
- not needing to use an eventQueue each frame and instead creating a frame 
  by reading from the Gamepad API, and
- being encouraged to remove more of the app code than is necessary just to 
  start integrating the actions system into the main codebranch without 
  breaking functionality.
Ideally (and I think in reality) we will be able to decide where and how to 
break from what we've done up till now with input and where to apply the 
actions system, if we agree something like this is how we ought to do it.
I don't claim we should use this code, but rather hypothesize we may and want 
to test the hypothesis openly, garnering feedback, criticism, and support 
(if it's any good).

If I complete support for the touchscreen, and a 3DOF device, then the 
code will be at a point where we can have a meaningful, example-driven 
discussion about its merits and shortcomings. This is not my immediate
plan because 1) I have a list of four or five minor issues and improvements
I mean to push out in the next couple days and 2) it's at least close 
to a state where I stand to benefit from some feedback from others.

"Priority" is how I've thought about how to resolve a situation where 
multiple "action sets" can "care about" a certain input (like the way 
a video object can "care about" both being grabbed and being played/paused,
currently on the same button for most platforms) and the app knows how 
to "decide" which of the action sets' actions should be "prioritized"
(do they want to pause or grab the object?).

I think "resolving priority" where each active set 
is assigned a priority value accounts for many of the differences between 
(3DOF, 6DOF, wands and such) and (mouse, keyboard, touchscreen) devices. 
I think supporting them will mostly require applying what is already 
learned from supporting mouse, keyboard, and touchscreen. 

I'm not sure that the current algorithm for "priority" resolution is the 
right one for the job, and I don't know how to test it besides implementing 
enough of the functionality we have in hubs to see it play out. 
Strategies that have been proposed are,
 - the user chooses the priority of each set or action within a set
 - the application chooses the priority of each set or actions within a set
 - the order that sets are activated determines their priority. (This is 
the way I currently implemented this. Not sure if it's any good. It seems 
correct for the use case described as : "point at something, activate an 
action set that corresponds with that thing, now your buttons do something
different". A concern about this model is that making the order of events
matter in the code is a good way to not understand how the actions system 
sets got into the state they're in on a given frame, especially since we 
haven't written any explicit control over the tick order of our aframe 
systems or components.

An example priority conflict I tried to resolve so far is when applying the 
"default binding definition for the mouse", the actions system decides to 
write a vector2 either for cursor movement or camera movement when processing
mousedown+mousemove events, and it does so based on the only state it carries 
that is directly manipulated by the application, namely the action sets active
at the start, and "user-provided" binding definitions (that are actually 
hard-coded as defaults in this implementation, but could EASILY be swapped 
out and probably should be, once a change using semantic paths lands).

An example of something this actions system does not help us with (and in 
fact makes us feel a mixture of pain and sadness), is that entering 
pointer lock (which we like to do when a user clicks the screen somewhere 
that is not a duck, or they right click when they're not "holding a pen")
is only permitted in response to a "short running event handler in response
to a user gesture". We can't wait until the frame to process the mouse 
click to enter and exit pointer lock.

* case study: touchscreen in hubs
