src/touch-actions.html
<div id="outline-container-org3d39957" class="outline-3">
<h3 id="org3d39957"><span class="section-number-3">3.1</span> our current application</h3>
<div class="outline-text-3" id="text-3-1">
<p>
In our current application (which does not have this action system),
the aframe component `"input-configurator"` configured in `hub.html`
</p>
<pre class="example">
&lt;a-scene
    input-configurator="
              gazeCursorRayObject: #player-camera;
              cursorController: #cursor-controller;
              gazeTeleporter: #gaze-teleport;
              camera: #player-camera;
              playerRig: #player-rig;
              leftController: #player-left-controller;
              leftControllerRayObject: #player-left-controller;
              rightController: #player-right-controller;
              rightControllerRayObject: #player-right-controller;"&gt;
&lt;/a-scene&gt;
</pre>
<p>
creates a TouchEventsHandler which, in response to touch events
changes the state of the application. 
</p>
<pre class="example">
// "handle" the events
document.addEventListener("touchstart", this.handleTouchStart);
document.addEventListener("touchmove", this.handleTouchMove);
document.addEventListener("touchend", this.handleTouchEnd);
document.addEventListener("touchcancel", this.handleTouchEnd);
</pre>
<p>
When a touchdown event occurs, we decide whether its touch is already 
handled by virtual joysticks, then (if not) we might move the cursor, 
call "forceCursorUpdate", and, if the cursor's "startInteraction" 
function returns true (which is not always, because the cursor may have 
nothing to "interact(ion)" with), "reserves" all future touch events' 
touches whose identifier matches this touch's identifier.
</p>
<pre class="example">
// The way we "handle" each (changed)touch in a "touchdown" event
// is to test whether it's already handled, or mutate app state.
// We "remember" what touches are "reserved" which comes in handy
// as we process future touch events.
function singleTouchStart(touch) {
  if (touch.clientY / window.innerHeight &gt;= VIRTUAL_JOYSTICK_HEIGHT) {
    return;
  }
  if (!this.touchReservedForCursor) {
    const targetX = (touch.clientX / window.innerWidth) * 2 - 1;
    const targetY = -(touch.clientY / window.innerHeight) * 2 + 1;
    this.cursor.moveCursor(targetX, targetY);
    this.cursor.forceCursorUpdate();
    if (this.cursor.startInteraction()) {
      this.touchReservedForCursor = touch;
    }
  }
  this.touches.push(touch);
}
</pre>
<p>
The touches produced by touchmove events move the cursor, manipulate
on-screen joysticks, move the character, and move the camera. At any point 
in time, touches can be "reserved" for certain actions.
</p>
<pre class="example">
handleTouchMove(e) {
  for (let i = 0; i &lt; e.touches.length; i++) {
    this.singleTouchMove(e.touches[i]);
  }
  if (this.needsPinch) {
    this.pinch();
    this.needsPinch = false;
  }
}

singleTouchMove(touch) {
  if (this.touchReservedForCursor &amp;&amp; touch.identifier === this.touchReservedForCursor.identifier) {
    const targetX = (touch.clientX / window.innerWidth) * 2 - 1;
    const targetY = -(touch.clientY / window.innerHeight) * 2 + 1;
    this.cursor.moveCursor(targetX, targetY);
    return;
  }
  if (touch.clientY / window.innerHeight &gt;= VIRTUAL_JOYSTICK_HEIGHT) return;
  if (!this.touches.some(t =&gt; touch.identifier === t.identifier)) {
    return;
  }

  let pinchIndex = this.touchesReservedForPinch.findIndex(t =&gt; touch.identifier === t.identifier);
  if (pinchIndex !== -1) {
    this.touchesReservedForPinch[pinchIndex] = touch;
  } else if (this.touchesReservedForPinch.length &lt; 2) {
    this.touchesReservedForPinch.push(touch);
    pinchIndex = this.touchesReservedForPinch.length - 1;
  }
  if (this.touchesReservedForPinch.length == 2 &amp;&amp; pinchIndex !== -1) {
    if (this.touchReservedForLookControls &amp;&amp; touch.identifier === this.touchReservedForLookControls.identifier) {
      this.touchReservedForLookControls = null;
    }
    this.needsPinch = true;
    return;
  }

  if (!this.touchReservedForLookControls) {
    this.touchReservedForLookControls = touch;
  }
  if (touch.identifier === this.touchReservedForLookControls.identifier) {
    if (!this.touchReservedForCursor) {
      this.cursor.moveCursor(
        (touch.clientX / window.innerWidth) * 2 - 1,
        -(touch.clientY / window.innerHeight) * 2 + 1
      );
    }
    this.look(this.touchReservedForLookControls, touch);
    this.touchReservedForLookControls = touch;
    return;
  }
}
</pre>
<p>
[Aside: Reserving touches like this seems to duplicate state, or&#x2026; allow for
the potential to miss state changes happening elsewhere. For example, the 
TouchEventsHandler does not know whether someone took an object from this 
touchscreen toucher's cursor. The touch will continue to be "reserved" for 
the cursor, then will "release" an object this user no longer has grabbed
when the touchend for it is fired. This happens to not cause any particularly
bad bugs in our app, except when someone takes something from the end of your 
cursor when you use a 3DOF/6DOF controller. In that case, you can call 
"changeCursorMod" on the cursor by "scroll"ing with your thumb. Perhaps the
MouseEventHandler/TouchEventHandler should be informed of this cursor state,
which may actually be state in super-hands.]
</p>

<p>
The basic idea for replacing the TouchEventsHandler is to replace the concept
of "reserving" touches for actions, instead set up a binding file for a 
touchscreen device's semantic paths to be used to transform its input and
resolving "priority" for action sets that care about the action mapped to 
by a given touch. The two-fold challenge of replacing TouchEventsHandler 
is in 
</p>
<ul class="org-ul">
<li>Replacing the "cursor update on demand in response to a touch event" codepath
with the same one that will be used for all other input devices and</li>
<li>Communicating raycast results back to the "device" in "lib code" such that
touching on a duck is different than touching on a pen is different than 
touching on nothing is different than having a second touch nothing, and 
then treating it like a pinch, and separating that from two touches that 
were meant to be a pinch that scaled a duck.</li>
</ul>

<p>
The TouchEventsHandler does not handle any of the behavior of the on-screen
buttons. Instead, these are handled via click handlers on the buttons themselves.
</p>
<pre class="example">

</pre>
</div>
</div>
