src/touch-actions.html
<div id="outline-container-orgfe8d2d3" class="outline-3">
<h3 id="orgfe8d2d3"><span class="section-number-3">3.2</span> using the actions system</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Our aframe systems/components may poll the actions system 
to read the the current frame's action state. 
</p>
<pre class="example">
// in character controller
function tick(t, dt) {
  const actions = AFRAME.scenes[0].systems.actions;
  const acc = actions.poll("accerateSelf"); // a vector 2
  if (acc) {
    this.acceleration.set(acc[0], 0, acc[1]);
  }
  if (actions.poll("snapRotateRight")) {
    this.snapRotateRight();
  }
  if (actions.poll("snapRotateLeft")) {
    this.snapRotateLeft();
  }
  // move the character
}
</pre>
<p>
The actions systems api exposes `isActive` and `poll`.
</p>
<ul class="org-ul">
<li>`isActive` receives the name of an action set and returns</li>
</ul>
<p>
a boolean indicating whether the action set is active in 
the most recent action frame.
</p>
<ul class="org-ul">
<li>`poll` receives the name of an action and returns the value</li>
</ul>
<p>
associated with that action from the most recent action frame.
</p>
<pre class="example">
AFRAME.registerSystem("actions", {
  isActive(set) {
    if (!this.didInit) return undefined;
    return history.read(0).sets.includes(set);
  },

  poll(action) {
    return history.read(0).actions[action];
  },
</pre>
<p>
Transformations of input state from various devices are bound 
to action state by having the appropriate filters (name subject to change)
assigned from an input to an output via a binding definition.
</p>
<pre class="example">
export const keyboardBindDefn = [
  {
    set: "selfSnapRotating",
    action: "snapRotateLeft",
    filter: "keydown",
    key: "q"
  },
// I'd like to change this to use "semantic paths", 
// a concept from the Steam Controller API + OpenXR:
// {
//   src: "/keyboard/q",
//   dest: "/selfSnapRotating/snapRotateLeft",
//   transformation: "keydown"
// },
  {
    set: "selfSnapRotating",
    action: "snapRotateRight",
    filter: "keydown",
    key: "e"
  },
  {
    set: "muteToggling",
    action: "toggleMute",
    filter: "keydown",
    key: "m"
  },
  {
    set: "screenShareToggling",
    action: "toggleScreenShare",
    filter: "keydown",
    key: "b"
  },
  {
    set: "selfMoving",
    action: "accSelf",
    filter: "key4_to_vec2",
    filter_params: {
      keys: ["d", "a", "w", "s"],
      filters: ["key", "key", "key", "key"]
    }
  },
// Here is an example where a transformation has multiple srcs:
// {
//   src: ["/keyboard/d",
//         "/keyboard/a",
//         "/keyboard/w",
//         "/keyboard/s"]
//   dest: "/selfMoving/accSelf",
//   transformation: "bool4_to_vec2" // transforms four bools to a vector2
//                                   // (the order of the srcs matter)
// },
  {
    set: "selfMoving",
    action: "boost",
    filter: "key",
    key: "shift"
  }
];
</pre>
<p>
Defining bindings this way allows for user customization and control.
The following mouse keybinding says to transform mousemove events' "movementX/Y" 
by multiplying each by user-customizable "LookSpeed" values then 
composing them into a vector2:
</p>
<pre class="example">
  {
    set: "looking",
    action: "look",
    filter: "vec2_deltas",
    filterParams: {
      horizontalLookSpeed: 0.1,
      verticalLookSpeed: 0.06,
      keys: ["dY", "dX"],
      filters: ["number", "number"]
    },
    priorityKey: "mousemove"
  },
// or, how I'd like to write it
// {
//   src: "/mouse/movementX",
//   dest: "/filters/mouseVerticalLook",
//   transformation: "multiply"
//   transformation_params: {
//     scalar : 0.06
//   }
// },
// {
//   src: "/mouse/movementY",
//   dest: "/filters/mouseHorizontalLook",
//   transformation: "multiply"
//   transformation_params: {
//     scalar : 0.1
//   }
// },
// {
//   src: ["/filters/mouseVerticalLook", "/filters/mouseHorizontalLook"],
//   dest: "/looking/look",
//   transformation: "compose_vec2"
// },
</pre>
<p>
The current binding definitions' bindings currently define an optional
"priorityKey" that is used to resolve conflicts that can occur when actions 
from two sets that are both active read from the same input or input that
is so closely related that it should block reading of all related value. 
For an example of the ladder, the "mousemove" priorityKey above describes 
the mousemove event's "movementX/Y" AND "clientX/clientY" values 
(and probably everything else in the mousemove event, even though "/mouse/move"
 is not a readable binding src). 
</p>

<p>
[Aside: I don't know if "/mouse/move" should be a readable binding src 
because we read input state in frames and mousemove events 
can occur multiple times in a frame. I suppose "/mouse/move" could be a 
readable binding src if we sum the results of deltas and always take the 
latest of clientX/Y and the others like that.]
</p>

<p>
I believe we will be able to know about all the "priorityKey" type of conflicts
automatically, so I think this is a temporary field in the binding file (and 
not meant to be customized by the user).
</p>

<p>
When the actions system ticks, it 
</p>
<ul class="org-ul">
<li>creates a new frame,</li>
<li>processes pending set changes to decide which sets should be active</li>
</ul>
<p>
this frame (which are the same as last frame, if there were no pending changes),
</p>
<ul class="org-ul">
<li>tells each device to "fill" the action frame, given the currently</li>
</ul>
<p>
active sets,
</p>
<ul class="org-ul">
<li>then saves the frame to its history.</li>
</ul>
<pre class="example">
tick() {
  const prev = history.read(0);
  const frame = {
    sets: [],
    actions: {},
    priorities: {}
  };
  const {sets, actions, priorities} = frame;
  for (const idx in prev.sets) {
    sets.push(prev.sets[idx]);
  }
  pendingSetChanges.forEach(sc =&gt; {
    const {set, fn} = sc;
    const isActive = sets.includes(set);
    if (!isActive &amp;&amp; fn === "activate") {
      sets.push(set);
    } else if (isActive &amp;&amp; fn === "deactivate") {
      sets.splice(sets.indexOf(set), 1); // TODO: replace splice
    }
  });
  applySetChanges(pendingSetChanges, frame.sets);
  pendingSetChanges.length = 0; // garbage
  devices.forEach(device =&gt; {
    device.fillActionFrame(frame);
  });
  history.write(frame);
}
</pre>
<p>
While at first glance this seems to me to "read nicely", I think it's
superficial "niceness", as the complexity of what's going on has just 
been buried into `fillActionFrame` on all of the devices. 
</p>

<p>
Still, I hope it shows very clearly a few things about the way this 
actions model works that are critical to understand in order to write 
application code against it:
</p>

<ol class="org-ol">
<li>Actions are written in frames. This means that application code queries</li>
</ol>
<p>
for the state of an action from the most recent "frame". If ever the action
system tick runs out-of-sync with other system/component updates (depending
on the architecture of the application (e.g. what we've been callign a 
"pure" entity-component system vs aframe/unity-monobehaviour "component-based 
architecture")), the application will be responsible for calling the action
system tick and reading from its history appropriately. 
</p>

<ol class="org-ol">
<li>Action state does not change mid-frame. This includes which action sets</li>
</ol>
<p>
are currently active. If you wish to change the actions that your buttons 
will enable when you "hover over" or "point to" or "select" or "activate" 
something in app code, and you try to "activate" the appropriate action set, 
you must wait until the NEXT FRAME before you can expect meaningful state 
to be returned when `poll`ing for action names from the "activate"d set.
</p>

<ol class="org-ol">
<li>The way I'm currently thinking about filling the action frame is by</li>
</ol>
<p>
iterating through all of the devices. Code that recognizes which devices 
are connected, as well as what to do when connection state changes, is 
not yet written. Also, the way binding definitions are assigned right 
now is written into the device definitions. The way the devices and 
"fillActionFrame" is more of a relic of the order in which I happened 
to start writing this system than it is a belief that this organization 
makes sense. `fillActionFrame` is now a reusable function that each 
device binds to itself (instead of passing in some arguments&#x2026; for no
apparent reason) because I initially started writing completely separate 
codepaths to support each device (go, mouse, keyboard, and now touchscreen)
and I wanted to look for commonalities AFTER some code that works was 
written, rather than during, when the differences between devices would 
be difficult to understand at first. An example of a way "fillActionFrame" 
is currently implemented that I think will change is that its implementation
includes a step where an "eventQueue" (full of browser events) is "framify"ed
into a[n input-]`frame`. Input devices whose state we'll read from the 
GamepadAPI will not have an eventQueue to "framify", so this organization 
is wrong.
</p>

<pre class="example">

</pre>
</div>
</div>
</div>
