doc/touch-actions.org
* a disclaimer about voice and purpose
In any given sentence, I or we might write I or we or we or I.
I or we don't know what voice to give a sentence when we are or I am
echoing concerns voiced initially by other people in a conversation that 
happened elsewhere.
Also we or I want to encourage other people to edit, improve, or refer to 
this document as they see fit, and that seems easiest to do when not talking
about a viewpoint, "I think yada yada yada" and instead is a assertion of 
something about the code, the model about the code, or the existence of some 
code snippet/pseudocode.
If it's easier for you, repeat the phrase, 
  "we be the royal we 'cuz we be royal-ty"
until you don't mind it anymore.

Regarding the format of this information, is this a useful format to capture 
these thoughts? Are there too many words here that will be out of date before
they become worth it? Let's see.

